src/test/testFiles/badWsdls/BLZService.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:blz="http://thomas-bayer.com/blz/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://thomas-bayer.com/blz/"><wsdl:types><xsd:schema attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://thomas-bayer.com/blz/">
<xsd:element name="getBank">
<xsd:complexType>
<xsd:sequence>
<xsd:element name="blz" type="xsd:string" />
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="getBankResponse">
<xsd:complexType>
<xsd:sequence>
<xsd:element name="bezeichnung" type="xsd:string" />
<xsd:element name="plz" type="xsd:string" />
<xsd:element name="ort" type="xsd:string" />
<xsd:element name="bic" type="xsd:string" />
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:schema></wsdl:types><wsdl:message name="getBankRequest"><wsdl:part name="part1" element="blz:getBank" /></wsdl:message><wsdl:message name="getBankResponse"><wsdl:part name="part1" element="blz:getBankResponse" /></wsdl:message><wsdl:portType name="BLZServicePortType"><wsdl:operation name="getBank"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="blz:getBankRequest" wsaw:Action="http://thomas-bayer.com/blz/getBank" /><wsdl:output xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="blz:getBankResponse" wsaw:Action="http://thomas-bayer.com/blz/blz/getBankResponse" /></wsdl:operation></wsdl:portType><wsdl:binding name="BLZServiceSOAP11Binding" type="blz:BLZServicePortType"><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" /><wsdl:operation name="getBank"><soap:operation soapAction="http://thomas-bayer.com/blz/getBank" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="BLZServiceSOAP12Binding" type="blz:BLZServicePortType"><soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" /><wsdl:operation name="getBank"><soap12:operation soapAction="http://thomas-bayer.com/blz/getBank" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input><wsdl:output><soap12:body use="literal" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="BLZServiceHttpBinding" type="blz:BLZServicePortType"><http:binding verb="POST" /><wsdl:operation name="getBank"><http:operation location="getBank" /><wsdl:input><mime:content type="text/xml" /></wsdl:input><wsdl:output><mime:content type="text/xml" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="BLZService"><wsdl:port name="BLZServiceSOAP11port_http" binding="blz:BLZServiceSOAP11Binding"><soap:address location="http://www.thomas-bayer.com:80/axis2/services/BLZService" /></wsdl:port><wsdl:port name="BLZServiceSOAP12port_http" binding="blz:BLZServiceSOAP12Binding"><soap12:address location="http://www.thomas-bayer.com:80/axis2/services/BLZService" /></wsdl:port><wsdl:port name="BLZServiceHttpport1" binding="blz:BLZServiceHttpBinding"><http:address location="http://www.thomas-bayer.com:80/axis2/rest/BLZService" /></wsdl:port></wsdl:service></wsdl:definitions>