Reports/20230111_101832/TestSuite1/20230111_101832/requests/main/8.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2023-01-11T02:19:33.791Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.thomas-bayer.com/axis2/services/BLZService?wsdl",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/html"
        } ],
        "queryString" : [ {
          "name" : "wsdl",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "text/html",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <getBank xmlns=\"http://thomas-bayer.com/blz/\">\n            <blz>50230000</blz>\n        </getBank>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Server",
          "value" : "Apache-Coyote/1.1"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Content-Length",
          "value" : "438"
        }, {
          "name" : "Date",
          "value" : "Wed, 11 Jan 2023 02:19:22 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml;charset=UTF-8"
        } ],
        "content" : {
          "size" : 438,
          "mimeType" : "application/xml",
          "text" : "<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Body><ns1:getBankResponse xmlns:ns1=\"http://thomas-bayer.com/blz/\"><ns1:details><ns1:bezeichnung>ABC International Bank Frankfurt am Main</ns1:bezeichnung><ns1:bic>ABCADEFFXXX</ns1:bic><ns1:ort>Frankfurt am Main</ns1:ort><ns1:plz>60325</ns1:plz></ns1:details></ns1:getBankResponse></soapenv:Body></soapenv:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 107,
        "bodySize" : 438,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "receive" : 0,
        "blocked" : -1,
        "dns" : -1,
        "connect" : 0,
        "send" : 0,
        "wait" : 0,
        "ssl" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "8",
        "testObjectId" : "Object Repository/SOAP Service/BLZServiceSOAP11Binding/getBank",
        "harId" : "15554d44-b0ed-46d3-9fe2-b7b322a80d4e",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}