test/fixtures/vcr_cassettes/blzservice.json

[
  {
    "request": {
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><getBank xmlns=\"http://thomas-bayer.com/blz/\"><blz>70070010</blz></getBank></soap:Body></soap:Envelope>",
      "headers": {
        "Content-Type": "text/xml; encoding=utf-8",
        "SOAPAction": ""
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://www.thomas-bayer.com/axis2/services/BLZService"
    },
    "response": {
      "binary": false,
      "body": "<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Body><ns1:getBankResponse xmlns:ns1=\"http://thomas-bayer.com/blz/\"><ns1:details><ns1:bezeichnung>Deutsche Bank</ns1:bezeichnung><ns1:bic>DEUTDEMMXXX</ns1:bic><ns1:ort>München</ns1:ort><ns1:plz>80271</ns1:plz></ns1:details></ns1:getBankResponse></soapenv:Body></soapenv:Envelope>",
      "headers": {
        "Server": "Apache-Coyote/1.1",
        "Content-Type": "text/xml;charset=UTF-8",
        "Date": "Wed, 25 Apr 2018 06:16:33 GMT",
        "Content-Length": "402"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]